# Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на
# экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
percent_name_dict = {1: "процент", 2: "процента", 3: "процента", 4: "процента", 5: "процентов", 6: "процентов", 7: "процентов", 8: "процентов", 9: "процентов", 0: "процентов"}
percents = int(input("Введите количество процентов: "))
print(f"Вы ввели {percents} {percent_name_dict[percents%10]}")
